let myName
console.log(myName)
// undefined

myName = 'Bogdan'

console.log(myName)
// undefined
// Bogdan

// в терміналі не повертається undefined після Bogdan
// Якщо потрібно
console.log(console.log(10))
// 10
// undefined


// Строгий режим, це режим приякому інтерпритатор більш строго дивиться за декими правилами
// Одна з основних, це обов'язково об'являти змінні
// Перша строка вказує на те, що це строгий режим, тект такий: 'use strict'
// Вказується на початку файла
'use strict'

// Таклож, якщо у функції буде створена змінна, то при НЕ строгому режимі вона буде доступна зовні, при строгому не буде доступна.
// Якщо об'явити змінну в середині функції, то вона не буде доступна в глобальній видимості при ВКЛЮЧЕНОМУ строгому режимі

// ЗМІНЮВАТИ ГЛОБАЛЬНІ ОБЛАСТІ В СЕРЕДИНІ ФУНКЦІЙ НЕ РЕКОМЕНДУЄЬСЯ!
// Тому працювати в строгому режимі рекомендується!
