// Далі відкрити консольв браузері, наприклад Хром
// Можна відкрити в новому вікні через меню або cntl+Shift+i

// node.js середовище виконання js кода
// open PowerShell
// node --version
// install node.js - https://nodejs.org/uk/
// Restart PowerShell
// node --version
// запустити інтерпритатор командою
// далі можна в консолі виконувати код, наприклад 3+ 2
// Щоб вийти з інтерпритатора потріно два ради натиснути Ctrl+c

// Встановити VSC
// install Code Runner
// restart VSC
// Тепер ми можемо запускати код в програмі VSC натискаючи Ctrl + Alt + N або кнопку run, або через вспливаюче меню
