// що таке console.log
// console - це об'єкт, можна визвати в консолі console та прзкрити об'єкт, там ми знайдемо метод log
// . - синтаксис, точковий запис, в даному мипадку ми отримуємо доступ до методу
// lod - метод, це також і функція
// () - визов метода, синтаксис ДС, в середині аргументи
// helpo world - значення типу строка
console.log('hello world')
// можна відрбарзити всі властивості об'єкта
console.dir()
// властивості у вигляді таблиці
console.table()

// далі відкрити браузер та відкрийте панель ррзпобників та відкрийте вкалдку консоль
// далі мржна вводити
console.log('hello world')
// люба функція повертає значення
// hello world
// undefined - значення повернуте інтерпрератором.

// Також в консолі можна console і в розкриваючому списку переглянути методи та властивості.

// Аналогічно запустимо в консолі
// Відкрити PowerShell
// Запустити node
console.log('hello world')
// hello world
// undefined
