// Модулі
// Проекти складіються з багатьох файлів
// Модулі допомагають структурувати код
// Кожен файл може мати частину функціоналу
// Також, допомагає не дублювати код

// Кожен файл являється окремим модулем, в кожному модулі можна задвати функціх, класи, змінні, різні операції - лиш потім експортувати за допомогою export частину змінних з такого модулю, і в інших модулях можна імпортувати ці змінні за допомогою import і використовувати їх.

// Синтаксис export/import - це інструкції
// файл voduleOne.js
const myName = () => {
  console.log('Bogdan')
}

export default myName

// файл voduleTwo.js
import printName from './voduleOne.js'
// .js - можна не писати
// якщо без ./ - це значить, що це зовняшній пакет
// тепер у нас доступна фенкція яка була у модулі voduleOne.js під назвою myName, а в voduleTwo.js вона доступна під назвою printName
printName() // Bogdan

// Щоб використовувати файли в node, розширення має бути myFile.mjs - .mjs
// в додатку є файли module_01.mjs та module_02.mjs
// Які можна запустити за допомогою консолі

// Відкрити консоль в VSC
// Перейти в папку
// Глянемі які є файли - ls
// Перевіримо версі. node - node --version
// Та визвати файл - node module_02.mjs
// Як видно, все працює, відповідь: Bogdan

// Важливо! Кожен модуль це окрема зона видимості.
// Тобто, ті змінні які не експортуються, вони не видимі в інших модулях, в інших файлах.

// ДЕКІЛЬКА ЕКСПОРТІВ
// створимо файл module_03.mjs та module_04.mjs

// ПРАВИЛА РОБИТИ З МОДЖУЛЯМИ
// 1. Вони мають бути цільові, одноцільові, тобто вони мають бути такими, щоб мижна було їх використовувати повторно
// 2. Робити експорт в самому низу файлу
// 3. Всі інструкції іспорт, на початку файлу
// 4. Рекомендується використовувати export default, якщол це можливо
// 5. Спочатку імпорт з зовнішніх модулей, а потім зі своїх модулей

// ЯК ВИКОРИСТОВУЮТЬСЯ МОДУЛІ В REACT
// npm - менеджер пакетів, за допомогоюб якого можна ставити зовнішні пакети
// npx - запускти однократно певні пакети
// Зазвичай один модуть використовують для одного компоненту!!!
