/** ЗАДАЧА 26 - Что будет выведено в консоли
 *
 * Что будет выведено в консоли?
 * Ответьте на вопрос без запуска кода
 */

function fn() {
  console.log('Привет из функции fn')

  return function (a) {
    console.log(a)
  }
}

fn()(true)

// Привет из функции fn
// true

// Так як повертається функція і відразу визивається з параметром
// Це типу, ми могли б присвоїти результат змінній, і помім цю змінну визвати як функцію з параметром, але в цьомиу прикладі ми відразу визвани функцію яка повертається! Круто!!!
