// Середа виконання JS
// Щоб використовувати пакет в якомусь додатку, потріно створити
// package.json

// Також, дивіться урок node, файл 10-npm.js

// package.json - створюється за допомогою команди: npm init, це робиться тільки один раз при ініціалізації додатка

/**
 * {
  "name": "my-project",
  "version": "1.0.0",
  "description": "",
  "main": "index.js",
  "scripts": {
    "start": "node index.js",
    "build": "node scropts/build.js",
    "test": "node scropts/test.js",
  },
  "author": "Viktor",
  "license": "ISC",
  "dependencies": {
    "moment": "^2.29.3",
    "bootstrap": "^5.1.3",
    "react": "^18.1.0"
  }
}
 */

// scripts - скрипти
// dependencies - залежності, вони потрібні щоб швидко встановити їх на будь якому компютера, і не зберагати їх при транспортування нашого проекту, а просто встановити їх.
// Аналогічним чином, немає сенсу зберігати ці файли в ГІТ репозиторії, так як всі залежності прописані в package.json, і папка з модулями node_modules додана в .gitignore
// Вствновлення залежностей за допомогою команди: npm install
// Тобто, папкою проекта можна поділитися без папки node_modules, і потім перейти в консолі в папку проекта та виконати команду npm install, таким чино консоль візьме з фацйлів package-lock.json та package.json інформацію по версіям та пакетам та встановить їх.
// таким чином він встановить всі пакети в папку nodeModules сам створить її

// СИМАНТИЧНЕ УПРАВЛІННЯ ВЕРСІЙ
// "bootstrap": "^5.1.3",
// "react": "~18.1.0"
// "moment": "2.29.3",

// * Значення версій:
// 5 - major, основна версія, коли внесли кардинальні зміни
// 1 - minor, мінорна версія, коли додали новий функціона, при цьому старий функціонал залишається працюючим.
// 3 - patch, петч версія, коли вносяться не великі зміни, старий функціонал залишається працюючим.

// тому якщо змінилася існовна версія і оновити додавток то можуть бути несімісності
// детальніше semver.org

// * Символи ^ та ~
// ^ - якщо стоїть, то допускаються встановлення новішої мінорної та петч пакету, тобто npm install може встановити вище значення, наприклад: 5.2.4
// ~ - якщо стоїть, то допускаються петч пакети, тобто npm install може встановити вище значення, наприклад: 5.1.5
// - якщо нічого, то ніяких оновлень, тільки конкретна версія!

// Автоматично оновлення не відбуваються, щоб оновити пакети потрібно виконати команду:
// * npm update <package-name>

// Якщо пакет вже не потрібний, щоб видалити його:
// * npm uninstall <package-name>

// СКРИПТИ NPM та ЗАПУСК
// "start": "node index.js"

// npm start - тобто, щоб не писати повний текст "node index.js", можна просто написати "start"
// npm run build - аналогічно, тільки не зрозумів чому run пписати
// npm test - аналогічно

//
// ЗАПУСК ДОДАТКА
//
/**
 * npm start
 * ця команда запустить наш проект, відкриється браузер
 *
 * Також в консолі виведеться така інформація:
 * Local:            http://localhost:3000
 * On Your Network:  http://192.168.190.1:3000
 * Note that the development build is not optimized. To create a production build, use npm run build.
 * webpack compiled successfully
 */
