// PROPS - властивості та STATE - стан

// Властивості це вводна інформація для любого компонента, вони передаються батьківських до дочерніх, а стан сможе змінюватися в середині елемента
// Компоненти можна викоритовувати в різних місцях, відповідно в них будуть різні батьківські компоненти, якісь компоненти мають стан, якісб не мають, стан може змінюватися. Стан не впливає на батьківські компоненти.
// Бітьківський компонент може передвати властивості ВКЛАДЕНИМ компонентам, а навпаки не можна, тобто порядок передачі в одному напрамку
// Перескакувати компненти щоб передати властивосіт також не можна!

// ВАЖЛИВИЙ ПРИНЦИП
// Властивості компонентів передаються від батьківськівських до дочерніх
// Компонент не має змінювати СВОЇ ВЛАСТИВОСТІ, не рекомендується змінювати свої властивості!!!
// А якщо потріна динаміка, то потрібно викоистовувати СТАН!
// Компонент в якому стан створений, має бути єдиним компонентом який має право зімнювати цей стан
// Компонент МОЖЕ змінювати свій СТАН
// Компонент не може змінювати СТАН ІНШИХ компонентів, але може впливати на зміну СТАНУ інших компонентів, тобто робити запит на зміну стану, а сама зміна відбувається в самому компоненті
// Можна передавати частину своїх властивостей та станів дочернім компонентам у ВИГЛЯДІ властивостей.

// РЕРЕНДЕРИНГ компонентів
// Компонент підлягає ререндирингу при зміні властивостей або стану

// ReactDOM, React Native - змінують стан реального ДОМ, порівнюючт його з віртуальним
// ReactDOM - стаціонарні, React Native - мобільні

// React HOOKS
// Появилися у версії 18.8
// За допомогою них можна керувати станом в функціональних компонентах!
// До нього можна було управляти тільки в класових компонентах React, а функціональні можна убла використовувати тільки для компонентів без власних станів (Statles)

// Основні хуки React
// useState
// useEffect

// Потріні прогарми:
// Відкрити консоль, ввести, якщо є версія - то встановлено!
// node --version
// npm --version
