// Ми видалили лишні файли та строки в дейких файлах
// Також, ми замінили favicon.ico в папці public (я цього не зробив)
// Також, ми зупинимо відслідковування git, для цього потрібно видалити приховану папку .git, а також .gitignore
// Щоб показати приховані папки, потрібно в налаштуваннях VScode знайти по слову exclude та видалити правило для .git в розділі Files: Exclude
// В мене .git в загальній папці, а в папці 99-template я видалив тільки .gitignore, бо паки .git не було

// В наступних проектах будуть присв'ячені певним частинам функціоналу React, а також короткі завдання
