/** ЗАДАЧА 72 - Копия массива
 *
 * Создайте копию массива.
 * При изменении копии массива оригинальный массив не должен изменяться
 */

const a = [1, 2, 3]

// ПЕРШИЙ ВАРІВАНТ СТВОРЕННЯ НОВОГО МАСИВУ НА ОСНОВІ ІНШОГО
const b = [...a]

// ДРУГИЙ ВАРІАНТ СТВОРЕННЯ НОВОГО МАСИВУ НА ОСНОВІ ІНШОГО
const c = Array.from(a)

// ТРЕТІЙ ВАРІАНТ СТВОРЕННЯ НОВОГО МАСИВУ НА ОСНОВІ ІНШОГО
const d = JSON.parse(JSON.stringify(a))

b.push('newElement')

console.log(a)
// [1, 2, 3]

console.log(b)
// [1, 2, 3, "newElement"]
