//  СКАЧАЙТЕ АРХИВ С ФАЙЛАМИ
//  К этой лекции присоединен файл TASKS.zip
//  Скачайте и разархивируйте его
//  Откройте папку TASKS в редакторе Visual Studio Code
//  В редакторе должны быть установлены расширения Code Runner и Prettier
//  Решайте каждую задачу в файле finish.js
//  В файлах solution.js находятся решения задач
//  ВАЖНО - перед выполнением кода с помощью Code Runner убедитесь что части кода не выделены.
//  Иначе Code Runner выполнит только выделенный код
//  Ресурсы, относящиеся к этой лекции
