// Далі відкрити консольв браузері, наприклад Хром
      // Можна відкрити в новому вікні через меню або cntl+Shift+i

      // node.js середовище виконання js кода
      // open PowerShell
      // node --version
      // install node.js - https://nodejs.org/uk/
      // Restart PowerShell
      // node --version
      // запустити інтерпритатор командою
      // далі можна в консолі виконувати код, наприклад 3+ 2
      // Щоб вийти з інтерпритатора потріно два ради натиснути Ctrl+c

      // Встановити VSC
      // install Code Runner
      // restart VSC
      // Тепер ми можемо запускати код в програмі VSC натискаючи Ctrl + Alt + N або кнопку run, або через вспливаюче меню

        // Принцип JS - все об'єкти
        // вирази, функції, об'єкти

          // Обєкт це тип данних
          // Приклад об'єкта
          {
            visible: true,
            color: 24,
            title: 'My Image',
            orientation: { // вложені об'кти
                angle: 0,
                type: 'landscape'
            },
            pixelDepth: 24
          }

          // Масив - об'єкт
          // Функція - об'єкт
          // Число - об'єкт
          // Строка - об'єкт