// Командна строка cmd

// https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dir

// dir - Відображає список файлів і підкаталогів каталогу. Якщо використовується без параметрів, ця команда відображає мітку тому та серійний номер диска, а потім список каталогів і файлів на диску (включаючи їх імена та дату та час останньої зміни кожного).

// cd - Відображає назву поточного каталогу або змінює поточний каталог. Якщо використовується лише з літерою диска (наприклад, cd C:), cd відображає назви поточного каталогу на вказаному диску. Якщо використовується без параметрів, cd відображає поточний диск і каталог.

// cd .. перейти на один рівень вищею

// mkdir, md - Створює каталог або підкаталог. Розширення команд, які ввімкнені за замовчуванням, дозволяють використовувати одну команду mkdir для створення проміжних каталогів за вказаним шляхом.

// type - У командній оболонці Windows type — це вбудована команда, яка відображає вміст текстового файлу. Використовуйте команду type, щоб переглянути текстовий файл, не змінюючи його. [type C:\localhost\newFolder\test.txt]

// del - Видаляє один або кілька файлів. Ця команда виконує ті ж дії, що й команда стерти.

// ping exampl.com - пінг, дізнатися IP веб-сайту. Перевіряє підключення на рівні IP до іншого комп’ютера TCP/IP, надсилаючи повідомлення echo Request протоколу керування повідомленнями Інтернету (ICMP).

// https://youtu.be/2I1HnSN1H9o

// netstat -an - показує поточні з’єднання
