import './App.css'
import Login from './components/Login'

// Стоврення форми, інтпута та даствити данні введених інпутів
// В даному випадку КОТРОЛЬОВАНІ ІНПУТИ
// Тобто, тепер компонент знає значення яке вводять
// Рекомендується використовувати контрольовані інпути!
// - таким чином можна виконувати валідацію введених даних
// - можна виводити якісь повідомлення в залежності від введених даних
// Потім ми навчилися передавати об'єкти щоб визивати тільки один useState, потім оптимізувати передачу через функцію

function App() {
  return (
    <div className="App">
      <Login />
    </div>
  )
}

export default App
