/**
 * Модуль HTTP
 * Позволяє стоврювати http сервер
 * Відправляти http запити на інші сервери
 * Запускається і виконує безкінечний цикл очікування подій
 */

// ! Створити HTTP сервер
// Приклад дуже простого HTTP серверу

// Імпорт з вдуованого модуля
const http = require('http')

// createServer - створити сервер
// req, res - запит від клієнта та відповідь від сервера
const server = http.createServer((req, res) => {
  // res - записати данні у відповідь
  res.statusCode = 200 // статус
  res.setHeader('Content-Type', 'text/html') // тип документа
  res.write('<h1>Hello from the Node.js</h1>') // контент документа
  res.end()
})

server.listen(3000)

// Щоб відправити запит на відділений запит
const http2 = require('http')
const url = 'https://jsonplaceholder.typicode.com/todos/1'

// Працює асинхронно
http2.get(url, (res) => {
  // Виконаємо в разі отримання відповіді від серверу
  let responceBody = ''

  // Реєструємо відстежувача події в залежності від подіє data, data - виникає декілька разів в залежностиі від об'єму данних
  res.on('data', (chunk) => {
    responceBody += chunk
  })

  // Як тільки ми закінчимо отримання данних, відбудеться подія end і після обробки всіх данних
  res.on('end', () => {
    console.log(responceBody)
  })
})

// ! Встановили додаток Thunder Client
// Позволяє тестувати API, позволяє відпрвляти запити на сервер безпосередньо в VSC
// Перед викорисстанням запустити node.js сервер
// Маєно нову іконку, тицяємо, натискаємо на кнопку New Reques
// Вводимо запить http://localhost:5000/html
// Отримуємо відповідь
// також бачимо:
// Status: 200 OK
// Size: 77 Bytes
// Time: 8 ms

// Також, вибирайте метод відправки данних

// Аналог, це програма https://www.postman.com/

// ! Скоротили програму
// винесли функції в окремий файл
// Не забуємо зробити експорт, а потім імпорт
