// Паттерн MVC
// * Model
// * Viev
// * Controller

// данний паттерт розділяє зони відповідальності різних чатин коду.
// Таким чином ми можемо навести порядок в своєму коді.
// Всі частини коду на своєму місці.
// Такі додатки легко підтримувати та масштабувати.

// * Model
// Зв'язок з данними які в БД, моделі взаємодії зв'язку з БД
// Тобто, ми якажемо - дай нам такий запит, і ця модель візьме данні з БД і віддасть тобі їх, при чому БД можуть бути різні, а запити до Model по суті однакові.

// * Viev
// Відображення інформації кінцевому користувачу
// Видивмий інтерфейс для користувача. Ми надсилаємо данні та файли для користувача.

// * Controller and Routes
// Логіка для взаємодії інтерфейса користувача з данними БД через модель.
// Routes частіше є частиною Controller.
// Контроллект безпосередньо надсилає відповідь клієнту!
