
/**
 * ! Приклад Redux State, reducer та action
 * Наступний код показує що робить redux, по суті це все, діже проста операція.
 * Що нам потрібно:
 * 
 * 1)
 * * Початковий стан:
 * - todos: [] - масив задач, на початку він пустий, ми будемо потім додавати туда задачі на протязі роботи програмиб видаляти, змінювати, очистити
 * - в об'єкті initilState можуть бути та інщі властивості ...
 * - в початковдму стані Redux ми можемо з'єднувати разні чатини стану нашого додатку.
 */

const initilState = {
  todos: [],
  ...
}

/**
 * 2)
 * * як виглядає дія, щоб додати задачу
 * ACTION, ACTION в Redux це всього навсього об'єкт, яке обов'язково містить властивість type!
 * payload - об'єкт який мість інофрмацію про задачу яку ми хочемо додати, наприклад ІД, текст і статус завершення!
 * Дія, дія виникає в якомусь з компонентів, компонент надсилає цю дію, і ця операція називається DISPATCH, яке потім попаджає в reducer!
 */

const action = {
    type: "ADD_TODO",
    payload: {
        id: 1,
        text: 'Learn Redux',
        isCompleted: false
    }
}

/**
 * 3)
 * * Як виглядає reducer
 * reducer приймає ТІЛЬКИ стан та дію.
 * reducer - чиста функція!
 * type, payload - це парметри з дії вище!
 */

function reducer(state, action) {
  const { type, payload } = action // реструктуризація для зручності та скороченні запису
  
  // ДОДАТИ
  if (type === 'ADD_TODO') {
    return {
      ...state, // інші властивості залишаємо
      todos: [...state.todos, payload], // нові додаємо, формуємо новий масив задач, на основі пепередніх 
    }
  }

  // Аналогічна умова якщо ВИДАЛИТИ, ЗМІНИТИ і т.п.

  // або повернути без змін
  return state
}

// Аналогіччно, тільки з використанням swith, загальноприйнятий спосіб:
/**
 swith (type) {
    case 'ADD_TODO':
      return {
        ...state, 
        todos: [...state.todos, payload],
      }
    default:
      return state
 }
 */

//  4)
// * Щоб створити новий стан
const newState = reducer(initilState, action)

// 5)
// В результаті ми отримаємо новий стан
/**
 
 const initilState = {
    todos: [
      {
        id: 1,
        text: 'Learn Redux',
        isCompleted: false
      }
  ],
  ...
}

 */
