import Info from './components/Info'
import './App.css'

function App() {
  return (
    <div className="App">
      <Info />
      <div className="info">
        <h1>App component heading</h1>
        <h2>Heading h2 in the App component</h2>
        <button className="my-button">App button</button>
      </div>
    </div>
  )
}

export default App

// Якщо ми робимо простий імпорт, то стилі доступні глобально, навіть в батьківських компонентах.
// import './App.css' - це простий імпорт
// Таким чином, при великих проектах можуть виниктути перетини стилів, а це не добре...!

// Якщо використовувати модульні стилі, то в нас генерується автоматичний суфікс для того, щоб назви класів дули різними.
// Ми створили файл Info.module.css
// Імпортували його import styles from './Info.module.css' в файл Info.js
// Таким чином ми отримали об'єкт styles, який містить властивості під назвами наших назв класів у модульному класі
// Вказуємо стиль просто, через крапковий доступ до властивостей: <div className={styles.Info}>
// А по факиту в наш код буде встановлений приблизно такий клас стилів - Info_info__0+lO2

// Але, стилізація не назвами класів, а просто тегами типу як h1, h2, a - то в такому випадку вони будуть діяти глобально!
// Назви класів рекомендується виковристовувати в стилі camelCase нотиації, так як вони є властиовостями JS об'єкту.
